Masmiseim36/nxpSDK/middleware/wireless/ieee_802_15_4_5.3.6/phy/source/MKW41Z/PhyStateMachine.c
#if gMWS_Enabled_d
            /* Dual Mode */
            if( (Phy_GetSeqDuration(pMsgIn) + mPhyOverhead_d) <= (MWS_GetInactivityDuration(gMWS_802_15_4_c) / 16) )
            {
                if( !mXcvrAcquired )
                {
                    if( gMWS_Success_c == MWS_Acquire(gMWS_802_15_4_c, FALSE) )
                    {
                        mXcvrAcquired = 1;
                    }
                    else
                    {
                        status = gPhyBusy_c;
                    }
                }
            }
            else
            {
                status = gPhyBusy_c;
                
                if( mXcvrAcquired && (state == gIdle_c) )
                {
                    mXcvrAcquired = 0;
                    MWS_Release(gMWS_802_15_4_c);
                }
            }
#endif

            /* Check if Radio is busy */
            if (seq_state && ((seq_state <= 0x06) || (seq_state == 0x15) || (seq_state == 0x16)))
            {
                if (pMsgIn->msgType == gPdDataReq_c)
                {
                    macToPdDataMessage_t *pPD = (macToPdDataMessage_t*)pMsgIn;
                    
                    if ((pPD->msgData.dataReq.CCABeforeTx != gPhyNoCCABeforeTx_c) && 
                        (pPD->msgData.dataReq.startTime == gPhySeqStartAsap_c))
                    {
                        if (pPhyStruct->flags & gPhyFlagDeferTx_c)
                        {
                            /* Postpone TX until the Rx has finished */
                            pPhyStruct->flags |= gPhyFlaqReqPostponed_c;
                            status = gPhyBusy_c;
                        }
                        else
                        {
                            phyLocal.channelParams.channelStatus = gPhyChannelBusy_c;
                            PLME_SendMessage(&phyLocal, gPlmeCcaCnf_c);
                            status = gPhyBusyRx_c;
                        }
                    }
                }
                else if (pMsgIn->msgType == gPlmeCcaReq_c)
                {
                    phyLocal.channelParams.channelStatus = gPhyChannelBusy_c;
                    PLME_SendMessage(&phyLocal, gPlmeCcaCnf_c);
                    status = gPhyBusyRx_c;
                }
            }
        }

        if (gPhyBusy_c == status)
        {
            /* Will be triggered on the next event */
            MSG_QueueHead (&pPhyStruct->macPhyInputQueue, pMsgIn);
            break;
        }
        else if (status == gPhySuccess_c)
        {
            if (gRX_c == state)
            {        
                state = gIdle_c;
                PhyPlmeForceTrxOffRequest();
            }
            
#if gMpmIncluded_d
            status = MPM_PrepareForTx( pMsgIn->macInstance );
#endif
            
            if (status == gPhySuccess_c)
            {
                pPhyStruct->flags &= ~(gPhyFlagIdleRx_c | gPhyFlaqReqPostponed_c);
                
                switch( pMsgIn->msgType )
                {
                case gPdDataReq_c:
                    status = Phy_HandlePdDataReq( pPhyStruct, (macToPdDataMessage_t *)pMsgIn );
                    break;
                case gPlmeCcaReq_c:
                    status = PhyPlmeCcaEdRequest(gPhyCCAMode1_c, gPhyContCcaDisabled);
                    break;
                case gPlmeEdReq_c:
                    status = PhyPlmeCcaEdRequest(gPhyEnergyDetectMode_c, gPhyContCcaDisabled);
                    break;
                default:
                    status = gPhyInvalidPrimitive_c;
                    break;
                }
            }
            
            /* Check status */
            if( gPhySuccess_c != status )
            {
                switch( pMsgIn->msgType )
                {
                case gPdDataReq_c:
                    pPhyStruct->channelParams.channelStatus = gPhyChannelBusy_c;
                    PLME_SendMessage(pPhyStruct, gPlmeCcaCnf_c);
                    //PD_SendMessage(pPhyStruct, gPdDataCnf_c);
                    break;
                    /* Fallthorough */
                case gPlmeCcaReq_c:
                    pPhyStruct->channelParams.channelStatus = gPhyChannelBusy_c;
                    PLME_SendMessage(pPhyStruct, gPlmeCcaCnf_c);
                    break;
                case gPlmeEdReq_c:
                    pPhyStruct->channelParams.energyLeveldB = 0;
                    PLME_SendMessage(pPhyStruct, gPlmeEdCnf_c);
                    break;
                default:
                    PLME_SendMessage(pPhyStruct, gPlmeTimeoutInd_c);
                    break;
                }
            }
        }
    }/* while( MSG_Pending(&pPhyStruct->macPhyInputQueue) ) */
    
    UnprotectFromXcvrInterrupt();
    
    /* Check if PHY can enter Idle state */
    if( gIdle_c == PhyGetSeqState() )
    {
        Phy_EnterIdle( pPhyStruct );
    }

}

/*! *********************************************************************************
* \brief  This is the PD SAP message handler
*
* \param[in]  pMsg Pointer to the PD request message
* \param[in]  instanceId The instance of the PHY
*
* \return  The status of the operation.
*
********************************************************************************** */
phyStatus_t MAC_PD_SapHandler(macToPdDataMessage_t *pMsg, instanceId_t phyInstance)
{
    phyStatus_t result = gPhySuccess_c;
    uint8_t baseIndex = 0;

    phyInstance = phyInstance;

    if( NULL == pMsg )
    {
        result = gPhyInvalidParameter_c;
    }
    else
    {
#if gMpmIncluded_d
        if( pMsg->msgType == gPdIndQueueInsertReq_c || pMsg->msgType == gPdIndQueueRemoveReq_c )
        {
            baseIndex = MPM_GetRegSet( MPM_GetPanIndex(pMsg->macInstance) );
            baseIndex = 
#if gPhyUseNeighborTable_d
                baseIndex * (gPhyHwIndQueueSize_c/gMpmPhyPanRegSets_c) +
#endif
                baseIndex * (gPhyIndirectQueueSize_c/gMpmPhyPanRegSets_c);
        }
#endif
        
        switch( pMsg->msgType )
        {
        case gPdIndQueueInsertReq_c:
            result = PhyPp_IndirectQueueInsert(baseIndex + pMsg->msgData.indQueueInsertReq.index,
                                               pMsg->msgData.indQueueInsertReq.checksum,
                                               phyInstance);
            break;
            
        case gPdIndQueueRemoveReq_c:
            result = PhyPp_RemoveFromIndirect(baseIndex + pMsg->msgData.indQueueRemoveReq.index,
                                              phyInstance);
            break;
            
