Masmiseim36/nxpSDK/middleware/wireless/ieee_802_15_4_5.3.6/phy/source/MKW41Z/PhyStateMachine.c
    if( (pPhyData->flags & gPhyFlagRxOnWhenIdle_c)
#if gMpmIncluded_d
       /* Prepare the Active PAN/PANs */
       && (gPhySuccess_c == MPM_PrepareForRx(gInvalidInstanceId_c))
#endif
      )
    {
#if gMWS_Enabled_d
        t = MWS_GetInactivityDuration(gMWS_802_15_4_c) / 16; /* convert to symbols */

        if( t < (mPhyMinRxDuration_d + mPhyOverhead_d) )
        {
            pPhyData->flags &= ~(gPhyFlagIdleRx_c);
            if( mXcvrAcquired )
            {
                mXcvrAcquired = 0;
                MWS_Release(gMWS_802_15_4_c);
            }
        }
        else 
        {
            if( t > (mPhyMaxIdleRxDuration_c + mPhyOverhead_d ) ) 
            {
                t = mPhyMaxIdleRxDuration_c;
            }
            else
            {
                t -= mPhyOverhead_d;
            }
            
            if( !mXcvrAcquired )
            {
                mXcvrAcquired = (gMWS_Success_c == MWS_Acquire(gMWS_802_15_4_c, FALSE));
            }
        }

        if( mXcvrAcquired )
#endif
        {
            pPhyData->flags |= gPhyFlagIdleRx_c;
            Phy_SetSequenceTiming( gPhySeqStartAsap_c, t );
            PhyPlmeRxRequest( gPhyUnslottedMode_c, &pPhyData->rxParams );
        }
    }
    else
    {
        pPhyData->flags &= ~(gPhyFlagIdleRx_c);
#if gMWS_Enabled_d
        t = MWS_GetInactivityDuration(gMWS_802_15_4_c) / 16; /* convert to symbols */

        if (t > mPhyOverhead_d)
        {
            uint32_t time = (uint32_t)(PhyTime_GetTimestamp() + t - mPhyOverhead_d);
            PhyTimeSetWakeUpTime(&time);
        }
        else if( mXcvrAcquired )
        {
            mXcvrAcquired = 0;
            MWS_Release(gMWS_802_15_4_c);
        }
        else
        {
            PhyTime_TMR4Callback();
        }
#endif
        if( mXcvrDisallowSleep && (gIdle_c == PhyGetSeqState()) )
        {
            mXcvrDisallowSleep = 0;
            PWR_AllowXcvrToSleep();
        }
    }
}

/*! *********************************************************************************
* \brief  This function sets the value of the maxFrameWaitTime PIB
*
* \param[in]  instanceId The instance of the PHY
* \param[in]  maxTime The maxFrameWaitTime value
*
********************************************************************************** */
void PhyPlmeSetFrameWaitTime( uint32_t maxTime, instanceId_t instanceId )
{
    phyLocal.maxFrameWaitTime = maxTime;
}

/*! *********************************************************************************
* \brief  This function sets the state of the PhyRxOnWhenIdle PIB
*
* \param[in]  instanceId The instance of the PHY
* \param[in]  state The PhyRxOnWhenIdle value
*
********************************************************************************** */
void PhyPlmeSetRxOnWhenIdle( bool_t state, instanceId_t instanceId )
{
    uint8_t radioState = PhyGetSeqState();
#if gMpmIncluded_d
    /* Check if at least one PAN has RxOnWhenIdle set */
    if( FALSE == state )
    {
        uint32_t i;

        for( i=0; i<gMpmMaxPANs_c; i++ )
        {
            MPM_GetPIB( gPhyPibRxOnWhenIdle, &state, i );
            if( state )
                break;
        }
    }
#endif

    if( state )
    {
        phyLocal.flags |= gPhyFlagRxOnWhenIdle_c;
#if gMpmIncluded_d
        if( (radioState == gRX_c) && (phyLocal.flags & gPhyFlagIdleRx_c) )
        {
            PhyPlmeForceTrxOffRequest();
        }
#endif
    }
    else
    {
        phyLocal.flags &= ~gPhyFlagRxOnWhenIdle_c;
        if( (phyLocal.flags & gPhyFlagIdleRx_c) && (radioState == gRX_c) )
        {
            PhyPlmeForceTrxOffRequest();
        }
    }

    if( gIdle_c == PhyGetSeqState() )
    {
        Phy_EnterIdle( &phyLocal );
    }
}

/*! *********************************************************************************
* \brief  This function starts the IdleRX if the PhyRxOnWhenIdle PIB is set
*
* \param[in]  instanceId The instance of the PHY
*
********************************************************************************** */
bool_t PhyIsIdleRx( instanceId_t instanceId )
{
    bool_t status = FALSE;
    uint8_t state = PhyGetSeqState();

    if( (phyLocal.flags & gPhyFlagIdleRx_c) && (gRX_c == state) )
    {
        status = TRUE;
    }

    return status;
}

/*! *********************************************************************************
* \brief  This function signals the PHY task that a TX operation completed successfully.
*         If the received ACK has FP=1, then the radio will enter RX state for
*         maxFrameWaitTime duration.
*
* \param[in]  instanceId The instance of the PHY
* \param[in]  framePending The value of the framePending bit for the received ACK
*
********************************************************************************** */
void Radio_Phy_PdDataConfirm(instanceId_t instanceId, bool_t framePending)
{
    PhyTimeDisableEventTimeout();

    if( framePending )
    {
        phyLocal.flags |= gPhyFlagRxFP_c;
#if 0
        if( phyLocal.maxFrameWaitTime > 0 )
        {
            /* Restart Rx asap if an ACK with FP=1 is received */
            phyLocal.flags &= ~(gPhyFlagIdleRx_c);
            Phy_SetSequenceTiming( gPhySeqStartAsap_c, phyLocal.maxFrameWaitTime );
            PhyPlmeRxRequest( gPhyUnslottedMode_c, &phyLocal.rxParams );
        }
#endif
    }
    else
    {
        phyLocal.flags &= ~gPhyFlagRxFP_c;
    }

    PD_SendMessage(&phyLocal, gPdDataCnf_c);
}

/*! *********************************************************************************
* \brief  This function signals the PHY task that new data has been received
*
* \param[in]  instanceId The instance of the PHY
*
********************************************************************************** */
void Radio_Phy_PdDataIndication(instanceId_t instanceId)
{
    PhyTimeDisableEventTimeout();

    PD_SendMessage(&phyLocal, gPdDataInd_c);
}

/*! *********************************************************************************
* \brief  This function signals the PHY task that timer1 compare match occured
*
* \param[in]  instanceId The instance of the PHY
*
********************************************************************************** */
void Radio_Phy_TimeWaitTimeoutIndication(instanceId_t instanceId)
{
    PhyTime_ISR();
}

/*! *********************************************************************************
* \brief  This function signals the PHY task that a CCA sequence has finished
*
* \param[in]  instanceId The instance of the PHY
* \param[in]  phyChannelStatus The status of the channel: Idle/Busy
*
* \return  None.
*
********************************************************************************** */
void Radio_Phy_PlmeCcaConfirm(phyStatus_t phyChannelStatus, instanceId_t instanceId)
{
    PhyTimeDisableEventTimeout();

