Masmiseim36/nxpSDK/middleware/wireless/ieee_802_15_4_5.3.6/phy/source/MKW41Z/PhyStateMachine.c
    phyLocal.channelParams.channelStatus = phyChannelStatus;

    PLME_SendMessage(&phyLocal, gPlmeCcaCnf_c);
}

/*! *********************************************************************************
* \brief  This function signals the PHY task that a ED sequence has finished
*
* \param[in]  instanceId The instance of the PHY
* \param[in]  energyLevel The enetgy level on the channel.
* \param[in]  energyLeveldB The energy level in DB
*
********************************************************************************** */
void Radio_Phy_PlmeEdConfirm(uint8_t energyLeveldB, instanceId_t instanceId)
{
    PhyTimeDisableEventTimeout();

    phyLocal.channelParams.energyLeveldB = energyLeveldB;

    PLME_SendMessage(&phyLocal, gPlmeEdCnf_c);
}

/*! *********************************************************************************
* \brief  This function signals the PHY task that the programmed sequence has timed out
*         The Radio is forced to Idle.
*
* \param[in]  instanceId The instance of the PHY
*
********************************************************************************** */
void Radio_Phy_TimeRxTimeoutIndication(instanceId_t instanceId)
{
    if( (phyLocal.flags & gPhyFlagIdleRx_c) != gPhyFlagIdleRx_c )
    {
        PLME_SendMessage(&phyLocal, gPlmeTimeoutInd_c);
    }
}

/*! *********************************************************************************
* \brief  This function signals the PHY task that the programmed sequence has started
*
* \param[in]  instanceId The instance of the PHY
*
* \return  None.
*
********************************************************************************** */
void Radio_Phy_TimeStartEventIndication(instanceId_t instanceId)
{
#ifdef MAC_PHY_DEBUG
    PLME_SendMessage(&phyLocal, gPlme_StartEventInd_c);
#endif
}

/*! *********************************************************************************
* \brief  This function signals the PHY task that the specified Rx watermark has been reached.
*         Also, if there is not enough time to receive the entire packet, the
*         RX timeout will be extended.
*
* \param[in]  instanceId The instance of the PHY
* \param[in]  frameLen the length of the PSDU
*
********************************************************************************** */
void Radio_Phy_PlmeRxWatermark(instanceId_t instanceId, uint32_t frameLength)
{
    /* In DualMode operation, sequence timeouts are strict, and cannot be extended. */
    if( ((phyLocal.flags & gPhyFlagDeferTx_c) == gPhyFlagDeferTx_c) && (frameLength <= gMaxPHYPacketSize_c) )
    {
        phyTime_t currentTime, t;

#if (gMWS_Enabled_d) || (gMWS_UseCoexistence_d)
        uint32_t inactiveTime = MWS_GetInactivityDuration(gMWS_802_15_4_c) / 16; /* [symbols] */
#endif

        OSA_InterruptDisable();

        /* Read currentTime and Timeout values [sym] */
        PhyTimeReadClock(&currentTime);
        /* Convert to symbols and add IFS and ACK duration */
        frameLength = frameLength * 2 + 54;

        t = (PhyTimeGetEventTimeout() - currentTime) & gPhyTimeMask_c;

#if (gMWS_Enabled_d) || (gMWS_UseCoexistence_d)
        if ((t > 1) && (inactiveTime > (frameLength + mPhyOverhead_d)))
#else
        if (t > 1)
#endif
        {
            /* Disable TMR3 compare */
            ZLL->PHY_CTRL &= ~ZLL_PHY_CTRL_TMR3CMP_EN_MASK;
            /* Write new TMR3 compare value */
            currentTime += frameLength;
            ZLL->T3CMP = currentTime;
            /* Enable TMR3 compare */
            ZLL->PHY_CTRL |= ZLL_PHY_CTRL_TMR3CMP_EN_MASK;
        }

        OSA_InterruptEnable();
    }

#ifdef MAC_PHY_DEBUG
    PLME_SendMessage(&phyLocal, gPlme_RxSfdDetectInd_c);
#endif
}

/*! *********************************************************************************
* \brief  This function signals the PHY task that a Sync Loss occured (PLL unlock)
*         The Radio is forced to Idle.
*
* \param[in]  instanceId The instance of the PHY
*
********************************************************************************** */
void Radio_Phy_PlmeSyncLossIndication(instanceId_t instanceId)
{
    PhyPlmeForceTrxOffRequest();
#ifdef MAC_PHY_DEBUG
    PLME_SendMessage(&phyLocal, gPlme_SyncLossInd_c);
#endif
    Radio_Phy_TimeRxTimeoutIndication(instanceId);
}

/*! *********************************************************************************
* \brief  This function signals the PHY task that a Filter Fail occured
*
* \param[in]  instanceId The instance of the PHY
*
********************************************************************************** */
void Radio_Phy_PlmeFilterFailRx(instanceId_t instanceId)
{
    if (phyLocal.flags & gPhyFlaqReqPostponed_c)
    {
        /* The Rx packet is not intended for the current device.
         * Signal a Channel Busy event, and discard the Tx request */
        phyLocal.flags &= ~(gPhyFlaqReqPostponed_c);
        if (MSG_DeQueue(&phyLocal.macPhyInputQueue))
        {
            Radio_Phy_PlmeCcaConfirm(gPhyChannelBusy_c, instanceId);
        }
    }
#ifdef MAC_PHY_DEBUG
    PLME_SendMessage(&phyLocal, gPlme_FilterFailInd_c);
#endif
}

/*! *********************************************************************************
* \brief  This function signals the PHY task that an unexpected Transceiver Reset
*          occured and force the TRX to Off
*
* \param[in]  instanceId The instance of the PHY
*
********************************************************************************** */
void Radio_Phy_UnexpectedTransceiverReset(instanceId_t instanceId)
{
    PhyPlmeForceTrxOffRequest();
#ifdef MAC_PHY_DEBUG
    PLME_SendMessage(&phyLocal, gPlme_UnexpectedRadioResetInd_c);
#endif
    Radio_Phy_TimeRxTimeoutIndication(instanceId);
}

/*! *********************************************************************************
* \brief  Senf a PLME message to upper layer
*
* \param[in]  instanceId The instance of the PHY
* \param[in]  msgType    The type of message to be sent
*
********************************************************************************** */
static void PLME_SendMessage(Phy_PhyLocalStruct_t *pPhyStruct, phyMessageId_t msgType)
{
    plmeToMacMessage_t * pMsg;
    
    pPhyStruct->flags &= ~(gPhyFlaqReqPostponed_c);
    
    if( pPhyStruct->PLME_MAC_SapHandler )
    {
        pMsg = Phy_BufferAlloc(sizeof(plmeToMacMessage_t));
        
        if(NULL == pMsg)
        {
            phyTimeEvent_t ev;
            
            ev.parameter = (uint32_t)msgType;
            ev.callback = Phy_SendLatePLME;
            ev.timestamp = gPhyRxRetryInterval_c + PhyTime_GetTimestamp();
            PhyTime_ScheduleEvent(&ev);
        }
        else
        {
            pMsg->msgType = msgType;
            
            switch(msgType)
            {
            case gPlmeCcaCnf_c:
                pMsg->msgData.ccaCnf.status = pPhyStruct->channelParams.channelStatus;
                break;
                
            case gPlmeEdCnf_c:
                pMsg->msgData.edCnf.status        = gPhySuccess_c;
                pMsg->msgData.edCnf.energyLeveldB = pPhyStruct->channelParams.energyLeveldB;
                pMsg->msgData.edCnf.energyLevel   = Phy_GetEnergyLevel(pPhyStruct->channelParams.energyLeveldB);
                break;
                
            default:
                /* No aditional info needs to be filled */
                break;
            }
            
