Masmiseim36/nxpSDK/middleware/wireless/ieee_802_15_4_5.3.6/phy/source/MKW41Z/PhyStateMachine.c
            pPhyStruct->PLME_MAC_SapHandler(pMsg, pPhyStruct->currentMacInstance);
        }
    }
}

/*! *********************************************************************************
* \brief  Senf a PD message to upper layer
*
* \param[in]  instanceId The instance of the PHY
* \param[in]  msgType    The type of message to be sent
*
********************************************************************************** */
static void PD_SendMessage(Phy_PhyLocalStruct_t *pPhyStruct, phyMessageId_t msgType)
{
    pdDataToMacMessage_t *pMsg;
    
    if( pPhyStruct->PD_MAC_SapHandler )
    {
        if( msgType == gPdDataInd_c )
        {
            uint32_t temp;
            uint16_t len = pPhyStruct->rxParams.psduLength - 2; /* Excluding FCS (2 bytes) */
            
            pMsg = pPhyStruct->rxParams.pRxData;
            pPhyStruct->rxParams.pRxData = NULL;
            
            FLib_MemCpy((uint8_t *)(pMsg->msgData.dataInd.pPsdu), (void*)ZLL->PKT_BUFFER_RX, len);
            
            if (pPhyStruct->flags & gPhyFlaqReqPostponed_c)
            {
                uint8_t *pPsdu = pMsg->msgData.dataInd.pPsdu;
                uint8_t  dstAddrMode = (pPsdu[mFrameCtrlHi_d] & mDstAddrModeMask_d) >> mDstAddrModeShift_d;

                /* Skip over FrameControl, SeqNo and PanID */
                pPsdu += mAddressingFields_d + 2;
                    
                if ((dstAddrMode == mShortAddr_d) && (pPsdu[0] == 0xFF) && (pPsdu[1] == 0xFF))
                {
                    /* The Rx packet is a broadcast message.
                     * Signal a Channel Busy event, and discard the Tx request */
                    pPhyStruct->flags &= ~(gPhyFlaqReqPostponed_c);
                    if (MSG_DeQueue(&pPhyStruct->macPhyInputQueue))
                    {
                        pPhyStruct->channelParams.channelStatus = gPhyChannelBusy_c;
                        PLME_SendMessage(pPhyStruct, gPlmeCcaCnf_c);
                    }
                }
            }
            
            pMsg->msgType                         = gPdDataInd_c;
            pMsg->msgData.dataInd.ppduLinkQuality = pPhyStruct->rxParams.linkQuality;
            pMsg->msgData.dataInd.psduLength      = len;
            
            pMsg->msgData.dataInd.timeStamp       = PhyTime_GetTimestamp();      /* current timestamp (64bit) */
            temp = (uint32_t)(pMsg->msgData.dataInd.timeStamp & gPhyTimeMask_c); /* convert to 24bit */
            pMsg->msgData.dataInd.timeStamp -= (temp - pPhyStruct->rxParams.timeStamp) & gPhyTimeMask_c;
#if !(gMpmIncluded_d)
            pPhyStruct->PD_MAC_SapHandler(pMsg, pPhyStruct->currentMacInstance);
#else
            {
                uint32_t i, bitMask = PhyPpGetPanOfRxPacket();
                
                for( i=0; i<gMpmPhyPanRegSets_c; i++ )
                {
                    if( bitMask & (1 << i) )
                    {
                        bitMask &= ~(1 << i);
                        pPhyStruct->currentMacInstance = MPM_GetMacInstanceFromRegSet(i);
                        
                        /* If the packet passed filtering on muliple PANs, send a copy to each one */
                        if( bitMask )
                        {
                            pdDataToMacMessage_t *pDataIndCopy;
                            
                            pDataIndCopy = Phy_BufferAlloc(sizeof(pdDataToMacMessage_t) + len);
                            if( pDataIndCopy )
                            {
                                FLib_MemCpy(pDataIndCopy, pMsg, sizeof(pdDataToMacMessage_t) + len);
                                pPhyStruct->PD_MAC_SapHandler(pDataIndCopy, pPhyStruct->currentMacInstance);
                            }
                        }
                        else
                        {
                            pPhyStruct->PD_MAC_SapHandler(pMsg, pPhyStruct->currentMacInstance);
                            break;
                        }
                    }
                }
            }
#endif
        }
        else
        {
            phyStatus_t status;
            
            if( (pPhyStruct->flags & gPhyFlagRxFP_c) == gPhyFlagRxFP_c )
            {
                pPhyStruct->flags &= ~(gPhyFlagRxFP_c);
                status = gPhyFramePending_c;
            }
            else
            {
                status = gPhySuccess_c;
            }
            
            pPhyStruct->flags &= ~(gPhyFlaqReqPostponed_c);
            pMsg = Phy_BufferAlloc(sizeof(phyMessageHeader_t) + sizeof(pdDataCnf_t));
            
            if(NULL == pMsg)
            {
                phyTimeEvent_t ev;
                
                ev.callback = Phy_SendLatePD;
                ev.parameter = (uint32_t)msgType;
                ev.timestamp = gPhyRxRetryInterval_c + PhyTime_GetTimestamp();
                PhyTime_ScheduleEvent(&ev);
            }
            else
            {
                pMsg->msgType = gPdDataCnf_c;
                pMsg->msgData.dataCnf.status = status;
                pPhyStruct->PD_MAC_SapHandler(pMsg, pPhyStruct->currentMacInstance);
            }
        }
    }
}


static void Phy_SendLatePLME( uint32_t param )
{
    PLME_SendMessage(&phyLocal, (phyMessageId_t)param);
}

static void Phy_SendLatePD( uint32_t param )
{
    PD_SendMessage(&phyLocal, (phyMessageId_t)param);
}

void Radio_Phy_Notify(void)
{
    Phy24Task(&phyLocal);
}

#if (gMWS_Enabled_d) || (gMWS_UseCoexistence_d)
/*! *********************************************************************************
* \brief  This function represents the callback used by the MWS module to signal
*         events to the 802.15.4 PHY
*
* \param[in]  event - the MWS event
*
* \return  status
*
********************************************************************************** */
static uint32_t MWS_802_15_4_Callback ( mwsEvents_t event )
{
    uint32_t status = 0;
    uint8_t xcvrState;

    switch(event)
    {
    case gMWS_Init_c:
#if gMWS_Enabled_d
        mXcvrAcquired = 0;
#endif
        break;

    case gMWS_Active_c:
        XCVR_ChangeMode(ZIGBEE_MODE, DR_500KBPS);
        XCVR_MISC->BLE_ARB_CTRL |= XCVR_CTRL_BLE_ARB_CTRL_BLE_RELINQUISH_MASK;
#if gMWS_UseCoexistence_d && gMWS_Enabled_d
        /* Restore Pin settings */
        MWS_CoexistenceInit(&gCoexistence_RfDeny, &gCoexistence_RfActive, &gCoexistence_RfStatus);
#endif
        break;

    case gMWS_Idle_c:
        // Phy24Task(&phyLocal);
        PHY_ForceIrqPending();
        break;

    case gMWS_Abort_c:
#if gMWS_Enabled_d
        mXcvrAcquired = 0;
#endif
        xcvrState = PhyGetSeqState();
        if( xcvrState != gIdle_c )
        {
            PhyAbort();
            switch(xcvrState)
            {
            case gCCA_c:
                if( gCcaED_c == (ZLL->PHY_CTRL & ZLL_PHY_CTRL_CCATYPE_MASK) >> ZLL_PHY_CTRL_CCATYPE_SHIFT )
                {
                    phyLocal.channelParams.energyLeveldB = (ZLL->LQI_AND_RSSI & ZLL_LQI_AND_RSSI_CCA1_ED_FNL_MASK) >> ZLL_LQI_AND_RSSI_CCA1_ED_FNL_SHIFT;
                    PLME_SendMessage(&phyLocal, gPlmeEdCnf_c);
                    break;
                }
            case gTX_c:
            case gTR_c:
                phyLocal.channelParams.channelStatus = gPhyChannelBusy_c;
                PLME_SendMessage(&phyLocal, gPlmeCcaCnf_c);
                break;
            case gRX_c:
                break;
            default:
                PLME_SendMessage(&phyLocal, gPlmeTimeoutInd_c);
                break;
            }
            PHY_ForceIrqPending();
        }
        break;

    case gMWS_GetInactivityDuration_c:
        /* Default status is 0 (Busy)  */
        if( gIdle_c == PhyGetSeqState() )
        {
            status = 0xFFFFFFFF;
        }
        break;

    default:
        status = gMWS_InvalidParameter_c;
        break;
    }

    return status;
}
#endif

#if gMWS_Enabled_d
/*! *********************************************************************************
* \brief  This function returns the duration of the PHY request in symbols
*
* \param[in]  pMsg Pointer to the PHY request message
*
* \return  seq duration in symbols
*
********************************************************************************** */
static uint32_t Phy_GetSeqDuration(phyMessageHeader_t * pMsg)
{
    uint32_t duration;
    
    /* Compute the duration of the sequence */
    switch( pMsg->msgType )
    {
    case gPdDataReq_c:
        duration = ((macToPdDataMessage_t *)pMsg)->msgData.dataReq.txDuration;
        break;
    case gPlmeCcaReq_c:
    case gPlmeEdReq_c:
        duration = gCCATime_c + gPhyTurnaroundTime_c;
        break;
    default:
        duration = 0;
    }
    
    return duration;
}
#endif /* gMWS_Enabled_d */

/*! *********************************************************************************
* \brief  This function will signal other protocols that the XCVR is unused.
*
* \param[in]  param unused
*
********************************************************************************** */
#if gMWS_Enabled_d
void PhyTime_TMR4Callback (void)
{
    if (MWS_GetActiveProtocol() == gMWS_None_c)
    {
        MWS_SignalIdle(gMWS_802_15_4_c);
    }
}
#endif /* gMWS_Enabled_d */

